// задачки з практики:
//1
// Напишіть код, який запитуватиме
// логін за допомогою prompt і буде виводити результат
// в консоль браузера

// Якщо користувач вводить "Адмін",
// то prompt запитує пароль.
// Якщо нічого не ввели або натиснута клавіша Esc
// вивести рядок "Скасовано"
// Інакше вивести рядок "Я вас не знаю"

//Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести рядок "Привіт!"
// інакше виводити рядок "Невірний пароль!"


//2
// За допомогою циклу for додайте всі парні числа від min до max
//const max = 50;
//const min = 0;
// ---РІШЕННЯ----
// const max = 7;
// const min = 0;
// let total = 0;
// for (let i = min; i <= max; i+=1) {
//     if (i % 2 !== 0) {
//         total+=i;
//     }
// }
// console.log(total);


//3
// За допомогою циклу for виведіть всі непарні числа від min до max
//const max = 100;
//const min = 1;


//4
// При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа продовжується доти,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення, натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Зробити перевірку, що користувач ввів саме число,
// а не довільний набір символів.
// ---РІШЕННЯ----
// let total = 0;
// while (true) {
//     const number = prompt("enter number");
//     if (number === null) {
//         break;
//     } 
//     total+=Number(number);
// }
// alert(`Загальна сума введених чисел дорівнює ${total}.`)


//5
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо користувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл повинен запитувати число, поки користувач не
// введе число більше 100, або натисне кнопку
// Скасування в prompt
// ---РІШЕННЯ----
// const validNumber = 100;
// let userNumber 
// do {
//     userNumber = prompt("Enter number", 5);
// } while (userNumber < validNumber);

// console.log(userNumber);


//6
// У змінній min лежить число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число(у першу, другу, третю чи четверту).
// ---РІШЕННЯ----
// const number = 333;
// if(number >= 0 && number <=15) {
//     console.log("first");
// } else if(number > 15 && number <=30) {
//     console.log("second");
// } else if(number > 30 && number <=45) {
//     console.log("third");
// } else if(number > 45 && number <=59) {
//     console.log("fourth");
// } else console.log("unknown number");


//7
// Перепишіть конструкцію if за допомогою умовного оператора '?':
// const a = 1;
// const b = 2;
// let result;
//
// if (a + b < 4) {
//   result = 'Many';
// } else {
//   result = 'Much';
// }
// ---РІШЕННЯ----
// const a = 1;
// const b = 2;
// let result;
// result = (a + b < 4) ? 'Many' : 'Much';
// console.log(result);


//8
// Напишіть через світч пошук автора мови програмування
// Пишемо назву мови у шаблонному рядку отримує відповідь: мова та автор
// PHP Расмус Лердорф
// C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота
// Swift Кріс Латтнер
// JS Брендан Ейх
// Java Джеймс Гослінг
// Python Гвідо ван Россум
// ---РІШЕННЯ----
// const language = 'JS';
// // const lowerLanguage = language.toLowerCase();
// switch (language.toLocaleLowerCase()){
//     case 'php':
//         console.log('PHP Расмус Лердорф');
//         break;
//     case 'c#': 
//         console.log('C# група інженерів компанії Microsoft під керівництвом Андерса Хейлсберга та Скотта Вільтаумота');
//         break;
//     case 'swift': 
//         console.log('Swift Кріс Латтнер');
//         break;  
//     case 'js': 
//         console.log('JS Брендан Ейх');
//         break;  
//     case 'java': 
//         console.log('Java Джеймс Гослінг');
//         break; 
//     case 'python': 
//         console.log('Python Гвідо ван Россум');
//         break;      
//     default:
//         console.log('Wrong language');
//     }


// прості числа діляться на себе та на одиницю
// вивести послідовність чисел Фебоначче